import random

# Приветствие и выбор имени
name = input("Привет! Как тебя зовут? ")
print(f"Ну что, {name}, я загадал число от 1 до 100. Попробуй угадать!")

secret_number = random.randint(1, 100)
attempts = 0

while True:
    try:
        # Получаем ввод от игрока
        guess = int(input("Введи свое число: "))
        attempts += 1

        if guess < secret_number:
            diff = secret_number - guess
            if diff <= 5:
                print("Маловато, но ты ОЧЕНЬ БЛИЗКО! (Горячо 🔥)")
            else:
                print("Маловато! (Холодно ✨)")
        elif guess > secret_number:
            diff = guess - secret_number
            if diff <= 5:
                print("Многовато, но ты ОЧЕНЬ БЛИЗКО! (Горячо 🔥)")
            else:
                print("Многовато! (Холодно ✨)")
        else:
            print(f"ПОЗДРАВЛЯЮ, {name}! Ты угадал число за {attempts} попыток!")
            break
    except ValueError:
        print("Ошибка! Пожалуйста, вводи только числа.")